{
  "EXCEL_READ_ERR": {
    "title": "Excel Read Error",
    "message": "Unable to read excel file.\nThe file may be corrupted, or otherwise unable to be read."
  },
  "FILE_READ_ERR": {
    "title": "File Read Error",
    "message": "Unable to read specified file.\nThe file may be corrupted, invalid or otherwise unable to be read.\nIf applicable, try opening the file in excel and saving it before attempting to re-open in this program."
  },
  "FILE_READ_ERR_AFTER_SUCCESS": {
    "title": "File Read Error",
    "message": "Unable to read file.\nThe file may have been corrupted, deleted, or renamed since being selected."
  },
  "FILE_WRITE_ERR": {
    "title": "File Write Error",
    "message": "Unable to save file.\nThe data may have been corrupted, or the save location is inaccessible."
  },
  "INCOMPATIBLE_NOT_CLF": {
    "title": "Incompatible File",
    "message": "The chosen file is not a compatible AutoClassifier."
  },
  "REPORT_GENERATE_ERR": {
    "title": "Report Log Error",
    "message": "Unable to generate report: logfile inaccessible."
  },
  "FEATURE_ERR_NUM": {
    "title": "Feature Data Error",
    "message": "The classifier expects different number of features than selected."
  },
  "FEATURE_ERR_NAMES": {
    "title": "Feature Data Error",
    "message": "Given feature names do not match those expected by the classfier."
  },
  "BOLD_SEARCH_ERR": {
    "title": "Connection Error",
    "message": "There was an error searching BOLD. \nPlease check your connection and the status of the BOLD servers."
  },
  "BOLD_FILE_ERR": {
    "title": "Download Error",
    "message": "Download from BOLD returned an erroneous file, please try again."
  },
  "NAN_DUMP_ERR": {
    "title": "File Save Error",
    "message": "Unable to save the NANs file due to unknown error.\nPlease ensure the NANs file has not been corrupted."
  },
  "ALIGN_ERR": {
    "title": "Sequence Alignment Error",
    "message": "Sequence Alignment failed or was cancelled.\nPlease ensure that given sequences are alignable."
  },
  "DELIM_ERR": {
    "title": "Species Delimitation Error",
    "message": "The species delimitation failed or was cancelled.\nPlease ensure that the alignment is valid.\nError caught in delimitation of {} {}."
  },
  "FEATURE_GEN_ERR": {
    "title": "Feature Generation Error",
    "message": "Feature generation script failed or was cancelled.\nPlease check the alignment, or register an issue on the project repository.\nError caught in ftgen of {} {}."
  },
  "R_NOT_FOUND": {
    "title": "Rscript executable not found",
    "message": "The Rscript executable file was not found. Please verify that R is installed and that the program has its proper location."
  },
  "TAXON_NOT_PRESENT": {
    "title": "Chosen Split Level Not Present",
    "message": "The chosen split level ({}) is not present in the data.\nPlease choose a taxon split level that is present in the data."
  },
  "R_SCRIPT_FAILED": {
    "title": "R Script Error",
    "message": "The operation could not be completed due to an error in the relevant R script.\nPlease register an issue on the repository stating that the R script failed during the step you were trying to complete."
  },
  "RESPONSE_DECODE_ERR": {
    "title": "Response Decode Error",
    "message": "There was an error while decoding the server response. Please try again. If this operation fails repeatedly please check the status of BOLD servers and/or register an issue on the repository with the exact search terms used."
  },
  "UNHANDLED_EXCEPTION": {
    "title": "Unhandled Exception Caught",
    "message": "An unhandled exception has occurred. A traceback has been saved to the following file:\n{}.\n\nAs uncaught exceptions may lead to unexpected behavior, it is recommended you save any progress possible and re-launch the program."
  },
  "EMPTY_FILE": {
    "title": "Empty File",
    "message": "The chosen file is empty. Please select a non-empty file."
  },
  "INVALID_DELIM": {
    "title": "Invalid Delimitation",
    "message": "The selected delimitation file contains duplicate assignments for one or more samples. Please check the file and try again."
  },
  "DELIM_MISSING_ENTRIES": {
    "title": "Blank Entries",
    "message": "The chosen delimitation file has one or more blank entries. Please check the file and try again."
  },
  "MISSING_PIDS": {
    "title": "Delimitation Mismatch",
    "message": "The chosen delimitation is lacking one or more sequence processid's which are present in the primary data file.\nPlease ensure you have selected the correct delimitation for the current data.\nA list of missing processid's has been saved to the following file:\n{}"
  },
  "EXTRA_PIDS": {
    "title": "Delimitation Mismatch",
    "message": "The chosen delimitation contains sequence processid's which are not present in the primary data file.\nPlease ensure you have selected the correct delimitation for the current data.\nA list of extra processid's has been saved to the following file:\n{}"
  }
}
